{"id":15067,"date":"2023-10-22T19:55:30","date_gmt":"2023-10-22T19:55:30","guid":{"rendered":"https:\/\/www.geetra.com\/disclaimer-2\/"},"modified":"2023-10-22T19:55:30","modified_gmt":"2023-10-22T19:55:30","slug":"disclaimer-2","status":"publish","type":"page","link":"https:\/\/geetracom.local\/disclaimer-2\/","title":{"rendered":"Disclaimer"},"content":{"rendered":"<p>If you require any more information or have any questions about our site’s disclaimer, please feel free to contact us by email at talk2us@geetra.com<\/p>\n<p><strong>Disclaimers for Geetra.com<\/strong><\/p>\n<p>The content provided on Geetra.com website is presented in a sincere manner and intended for general informational purposes. Geetra cannot guarantee the completeness, dependability, and precision of this content. Any decisions or actions you make based on the information found on Geetra.com are solely your responsibility. Geetra shall not be held liable for any losses or damages arising from the utilization of our website.<\/p>\n<p>By navigating our website, you have the option to access external websites through hyperlinks. Although our goal is to direct you to valuable and morally sound websites, we lack authority over the content and character of these external sites. The inclusion of these links does not constitute a blanket endorsement for all content featured on those sites. It&#8217;s important to note that website owners and content can undergo alterations without advance notification, and this may transpire prior to us being able to eliminate a link that may have become irrelevant or problematic.<\/p>\n<p>It&#8217;s crucial to acknowledge that upon departing from our website, you may encounter differing privacy policies and terms on other sites, which fall outside of our purview. We strongly advise reviewing the Privacy Policies and &#8221;Terms of Service&#8221; of these external sites before participating in any transactions or sharing any information.<\/p>\n<p><strong>Consent<\/strong><\/p>\n<p>Through your utilization of our website, you are signifying your acceptance of our disclaimer and your agreement to abide by its stipulations.<\/p>\n<p><strong>Update<\/strong><\/p>\n<p>In the event of updates, amendments, or alterations to this document, such modifications will be conspicuously displayed on this page.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you require any more information or have any questions about our site’s disclaimer, please feel free to contact us by email at talk2us@geetra.com Disclaimers for Geetra.com The content provided on Geetra.com website is presented in a sincere manner and intended for general informational purposes. Geetra cannot guarantee the completeness, dependability, and precision of this content. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/geetracom.local\/wp-json\/wp\/v2\/pages\/15067"}],"collection":[{"href":"https:\/\/geetracom.local\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/geetracom.local\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/geetracom.local\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/geetracom.local\/wp-json\/wp\/v2\/comments?post=15067"}],"version-history":[{"count":0,"href":"https:\/\/geetracom.local\/wp-json\/wp\/v2\/pages\/15067\/revisions"}],"wp:attachment":[{"href":"https:\/\/geetracom.local\/wp-json\/wp\/v2\/media?parent=15067"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}